[{"text": "text"}, {"text": "beautiful death energy"}, {"text": "awww look at these cute red flags"}, {"text": "Fuck.\nFuck fuck fuck fuck.\nFuck fuck.\nFuck."}, {"text": "anyone who calls themself a life coach is terrifying"}, {"text": "anxiety triggers:\n-not eating enough\n-eating"}, {"text": "it's important to hate everything"}, {"text": "life is what happens when i'm avoiding life"}, {"text": "politicians texting me like bros who want sex and then after the election they’ll ghost"}, {"text": "sometimes i feel like i don’t have a partner, sometimes i feel like my only friend..."}, {"text": "independent bookstores, barnes and noble, amazon, wherever books exist in the wildhttps://twitter.com/1800deadmom/status/1054612716214640640 …"}, {"text": "yes, i wrote two more novels over the past two years and am doing a last round of edits on one of them now before my agent takes it to publishers...so we shall see https://twitter.com/marksfleur11/status/1054259109074153473 …"}, {"text": "we both knew i wasn't enough"}, {"text": "doing stuff that isn't sleeping is hard"}, {"text": "Transgender people... are people. Not a political stance, not an ideology, not an agenda... human beings, across a spectrum of beliefs and experiences.\n\nThere’s no such thing as “I don’t agree with transgender.” We are a group of people that exist; our existence isn’t a question."}, {"text": "also on spotify https://open.spotify.com/show/3AxeWHyeLI4F6ovYjfW7HT?si=Qt6lJC_LTJ2M3d94hvBDWA …pic.twitter.com/Le6rRdNDnH"}, {"text": "new episode of my “show” explores the dollar store, a peaceful death, mania, worthlessness, weird pee smell, illusion of okayness, illusion of controlhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=4630537b-2e57-35de-0d61-aeb22f7c7f20 …"}, {"text": "@TransLifeline is a wonderful group of good people that provides suicide prevention support specification for trans ppl!https://www.translifeline.org/donate "}, {"text": "that which does not kill you but makes you sleep all day"}, {"text": "listen, it's not my fault i don't love myself"}, {"text": "ok i’m done for the night https://twitter.com/sosadtoday/status/1053865923688357888 …"}, {"text": "ask me anything"}, {"text": "i think you've mistaken my low self-esteem for kindness"}, {"text": "ignore at first sight"}, {"text": "high on existential dread"}, {"text": "*watches life fall apart*"}, {"text": "i don’t have a brand i have a compulsive need to escape myself"}, {"text": "want to touch my anxiety?"}, {"text": "person: hi\n\nme: i'm sorry i'm not enough"}, {"text": "how doomed do you think i am?"}, {"text": "no i can’t just “believe in myself”"}, {"text": "high on soda"}, {"text": "Wow, I can't wait to not talk to people all weekend."}, {"text": "every time i get out of bed is a disaster"}, {"text": "i never know what the hell anyone is talking about"}, {"text": "if you liked the chapter in So Sad Today \"Love Like You Are Trying to Fill a Spiritual Hole with Another Human Being Who Will Suffocate in There\" then read my novel, The Pisceshttps://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559/ref=sr_1_1?ie=UTF8&qid=1539907470&sr=8-1&keywords=the+pisces …"}, {"text": "boost my dopamine, thankshttps://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559/ref=sr_1_1?ie=UTF8&qid=1539907470&sr=8-1&keywords=the+pisces …"}, {"text": "feeling hopeless dot gov"}, {"text": "5 moods in 5 minutes"}, {"text": "it has been confirmed that i am not enough"}, {"text": "come over and give up on me"}, {"text": "here let me just rip my heart out and give it to you"}, {"text": "seems like everyone is a professional selfie taker and i'm just eating cereal"}, {"text": "just spent 2 hours with people so now i need a week alone"}, {"text": "Life is a delicate balance between managing your depression & letting time slowly destroy your body."}, {"text": "don't mind me I'm not really alive"}, {"text": "hating myself just seems natural"}, {"text": "bitch i am fear of failure"}, {"text": "look, i hate myself as much as the next guy"}, {"text": "bucket list:\n\n-go back to bed"}, {"text": "https://twitter.com/cl_ribes/status/1051521844946325504 …"}, {"text": "will probably hate my body till like 5 minutes before i die and then be like wait"}, {"text": "i liked you better when you were imaginary"}, {"text": "1. wake up\n2. try to figure out who hates me so i can waste my life attempting to win their love"}, {"text": "can I count on you to let me down?"}, {"text": "oh fuck i'm still me"}, {"text": "when i'm by myself i'm almost ok"}, {"text": "hell! starring other people"}, {"text": "*apologizes to person who wronged me for them wronging me*"}, {"text": "should i go to bed bath and beyond?"}, {"text": "i feel guilty for things i didn’t even do"}, {"text": "if i don’t go to a pumpkin patch this weekend i’m going to fucking snap"}, {"text": "let's spend the rest of our lives thinking about each other except i get to stop thinking about you but you have to keep thinking about me"}, {"text": "on this episode i talk about laughing cow cheese, death, astrological love bullshit, dying, a vacuum, my cremation, and the stunning conclusion of peeing in a starbucks cup"}, {"text": "welcome to another episode of the eating alone in my car show with your host so sad todayhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=bc52fb91-2cb0-f774-4ab9-24e419746d83 …"}, {"text": "my problem areas are my body and my mind"}, {"text": "Was Ursula even a villain or did Ariel’s dumb ass just not read the contract????"}, {"text": "https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=bc52fb91-2cb0-f774-4ab9-24e419746d83 …  "}, {"text": "watching myself fuck up in slow motion"}, {"text": "someone just emailed me and was like \"i'm agitated, is your book saying people should blame their parents for their problems?\" and i'm like \"NO!\"(but secretly yes lol)"}, {"text": "*panics over something dumb*"}, {"text": "i’m at subway living my dreams"}, {"text": "no i can't just \"get out of bed\""}, {"text": "for some of us, tomorrow is also mental health awareness day and also the next day and the next day and the next day"}, {"text": "i think my house is haunted but unfortunately not by anything cool that’s trying to kill me"}, {"text": "\"you might be my soulmate\" -me to 100000 people"}, {"text": "consciousness is a disaster"}, {"text": "*sees red flags*\n\n*ignores them*"}, {"text": "protect me from what i want and also from what i don't want and also from having to talk to anyone"}, {"text": "i came, i saw, i felt like people were judging me"}, {"text": "oops, totally didn't mean to be emotionally honest"}, {"text": "\"it just gives me a lot of anxiety\" --me about everything"}, {"text": "unfortunately i'm very self-aware"}, {"text": "step 1: wake up\nstep 2: be not enough"}, {"text": "powerpoint presentation of my insecurities"}, {"text": "it takes 374621962558361 x the amount of time you knew someone to get over them"}, {"text": "getting over people is a fucking miracle"}, {"text": "https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000413960767 …https://twitter.com/saruhschwartz/status/1048341788275036161 …"}, {"text": "making the same mistakes and expecting different results and lovin it"}, {"text": "inside i'm sleeping"}, {"text": "beware the fuckboy who talks about fuckboys as though he is not a fuckboy"}, {"text": "imagining a world without frat boys"}, {"text": "i hate you come over"}, {"text": "i did everything wrong today and i did it with low self-esteem"}, {"text": "siri, how can i be a good person but without any discomfort on my part"}, {"text": "poetry is wasted on longing for boys"}, {"text": "i feel upset but not surprised by humanity"}, {"text": "sorry to hear about your positive attitude"}, {"text": "sun in no, moon in oh fuck, i need to be alone rising"}, {"text": "The people! United! Are crying on the couch!"}, {"text": "https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=e4feb4e6-8ca6-b04d-c569-074cc1c9b47d …"}, {"text": "what the fuck is everything"}, {"text": "i feel empty and unsure dot com"}, {"text": "'sensitive' boys are even more dangerous than regular boys"}, {"text": "boy: i'm a feminist\nboy: so you should fuck me"}, {"text": "what if my destiny sucks"}, {"text": "watching myself get more insecure in slow motion"}, {"text": "just ignore the cold universe"}, {"text": "\"this is the worst feeling\" --me about any feeling"}, {"text": "officially at war with my body"}, {"text": "in theory i'm totally over you"}, {"text": "it's all good --me lying"}, {"text": "every day is depression awareness day"}, {"text": "got over you but then saw you again"}, {"text": "meditating on my shittiness"}, {"text": "just forgot that life is pain and then remembered again"}, {"text": "sun in 7-11, moon in subway, cheesecake factory rising"}, {"text": "let's pretend i'm better looking than i am"}, {"text": "so sad today"}, {"text": "Sure taking care of yourself feels good but have you ever tried taking terrible care of yourself? For a little while it feels AMAZING."}, {"text": "when you realize everything is stupid it feels lonely"}, {"text": "the purpose of our government, as found in the constitution, is to \"establish Justice, insure domestic Tranquility, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our posterity” lololololololol "}, {"text": "take a lot of naps and ignore a lot of people"}, {"text": "if you're insecure, anxious, self-obsessed and lonely at least be amazing at it"}, {"text": "i'm so not necessary"}, {"text": "yeah i retweet myself i got a fuckin problem"}, {"text": "Ever just look at a dude and know his name is \"Brett\"."}, {"text": "reminder that after 5 minutes i always want to leave"}, {"text": "i’m either acting out or hiding from everything"}, {"text": "i pretend to be strong so people will leave me alone"}, {"text": "not to toot my own tweet but is the nobel committee even paying attention or are they too busy with someone “curing diseases”"}, {"text": "i mean these are some hot tweetems right here"}, {"text": "let’s all take a moment and be brutally honest with ourselves...my tweets are really good tonight"}, {"text": "should i just casually destroy my life"}, {"text": "what do you mean you don’t think it’s weird we are alive"}, {"text": "pharmacist: the generic prozac capsule is no different than the generic prozac pill, it’s just the manufacturer is different \n\nme: i don’t recognize this world around me. time and space have lost their relevance. what are we even made of? are you even real?"}, {"text": "i'm always late for everything because i don't want to be anywhere"}, {"text": "gonna stop worrying about shit beyond my control just kidding"}, {"text": "so annoyed that fantasy isn't reality"}, {"text": "Hey! Create a web presence! Be fun and dynamic! Then slip into a major depression brought on by lack of human communication and join a dangerous cult! Then workout constantly and get scary and agressive! Then finally become a chef!"}, {"text": "oh great another hour of my life"}, {"text": "if i have to watch my whole life flash before my eyes when i die i'm going to be so annoyed"}, {"text": "everything is so full of shit"}, {"text": "being born is so mean"}, {"text": "brb, the world has fallen short of my unrealistic expectations"}, {"text": "no i don't have any self esteem, what do you think i am a person with self-esteem?"}, {"text": "time heals all wounds no it doesn't"}, {"text": "not sept 12 sept 27 but u get ithttps://twitter.com/sosadtoday/status/1044289641522888709 …"}, {"text": "hey valley people \n\ni’m reading, speaking and signing at @csunorthridge this thurs sept 12 at 12:45 PM as part of their banned books event\n\nlakeview terrace room at the student union \n\nall welcome. there will be pizza "}, {"text": "omg i love your opinion about bullshit"}, {"text": "insecurity is forever"}, {"text": "or spotify if ya nastyhttps://open.spotify.com/show/3AxeWHyeLI4F6ovYjfW7HT …"}, {"text": "https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=ef7dbac0-db4e-2fb3-5be9-7d0534be4bd7 … pic.twitter.com/1GxNQAkbNO"}, {"text": "preppy men are terrifying"}, {"text": "shopping list:\n-self-esteem\n-the ability to say no without feeling like a bitch\n-a few moments of peace\n-new body"}, {"text": "ever just feel paranoid as fuck for your entire life"}, {"text": "*whispers during sex* i just needed to escape myself"}, {"text": "i want to make out with 100 people and also be alone"}, {"text": "i have to be punched in the face by my loneliness before i reach out to someone"}, {"text": "should we bother being in each other's lives if we can't make out"}, {"text": "it’s not my fault i’m from another planet"}, {"text": "A tale of love, sex, obsession... and a merman\n\nDive into The Pisces by @sosadtoday #GetWet pic.twitter.com/G8JeDRlRvp"}, {"text": "i prefer dark shitty places"}, {"text": "the war in my mind says hey"}, {"text": "I love crying in cabs then checking my hair in the rear view mirror amen"}, {"text": "so, do you love being fake?"}, {"text": "cause of death: your positive attitude"}, {"text": "your dumb life looks better than my dumb life on the internet, you win!"}, {"text": "people like to feel part of something stupid"}, {"text": "i can't stop being me and it's depressing"}, {"text": "i’m bad at breathing"}, {"text": "i can’t stop peeing: the musical"}, {"text": "white castle is gothhttps://twitter.com/ReneeMatarazzo/status/1042558285180796928 …"}, {"text": "on notice! https://twitter.com/ephemeraldayss/status/1042566303507275776 …"}, {"text": "i approach everything from a place of oh no"}, {"text": "it's important to make everything awkward"}, {"text": "oops, it felt like self-love but it was self-destruction"}, {"text": "i'm bad for me"}, {"text": "it's always mental health awareness week in my body"}, {"text": "breaking news: still afraid of feelings"}, {"text": ".@petracollins in her book Coming of Agepic.twitter.com/wXLz9yTbP5"}, {"text": "be your own apocalyptic nightmare"}, {"text": "pic.twitter.com/m8p8dQvE1c"}, {"text": "it gets better and then it gets worse and then it gets better but you're like nah i don't trust it"}, {"text": "can't decide if i've made enough mistakes yet to go to bed"}, {"text": "new episode of my podcast (yes i have a podcast)https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2 …"}, {"text": "there are two kinds of people in this world and i’m hiding from them both"}, {"text": "Congratulations on your various marriages, engagements, and photogenic love lives!!!!!"}, {"text": "In the middle of the night it’s Poetry that waits for you"}, {"text": "*me flirting with someone* so i've never liked living in a body"}, {"text": "watching people be normal and i just don't understand"}, {"text": "i’m not a courageous person i’m just impulsive"}, {"text": "i think i’m pansexual but too lazy to change my driver’s license from bisexual so"}, {"text": "today at 4 https://twitter.com/crystalhanak/status/1040983963202998273 …"}, {"text": "once i overcome my insomnia, hypochondria, internet addiction and fear of rejection, it's over for you bitches"}, {"text": "je suis diagnosing myself with a fatal illness"}, {"text": "help i can't stop thinking"}, {"text": "pretend you miss me thanks!"}, {"text": "hire me to dj your party while laying on the floor"}, {"text": "if i was a DJ i would do it laying down"}, {"text": "i love you so i can never speak to you again"}, {"text": "forbidden love...because unforbidden love is for those who are okay with genuine intimacy"}, {"text": "doing this panel on forbidden love (oooooooooh)  tomorrow at 4 PM at @BKBF  signing after https://www.brooklynbookfestival.org/events/forbidden-love/ …"}, {"text": "because everything suckshttps://twitter.com/ELLEmagazine/status/1040949035723632640 …"}, {"text": "i have decided that i am doomed"}, {"text": "je suis at war with myself"}, {"text": "i'm a worst case scenario"}, {"text": "find what you love and maintain a fear of intimacy"}, {"text": "i fucking love @samanthajhunt’s book The Seas (i was destroyed by it) and talked with her about romantic obsession, reality and mer-creatureshttps://www.elle.com/culture/books/a23128576/melissa-broder-samantha-hunt-interview/ …"}, {"text": "We needed this in our lives: @samanthajhunt and @melissabroder in conversation about their respective mer-person books—and female sexuality, and the meaning of myth, and why we all need to question reality—for @ELLEmagazine.https://www.elle.com/culture/books/a23128576/melissa-broder-samantha-hunt-interview/ …"}, {"text": "someone with a clipboard just came up to me and said “would you like to save a baby today?” and i accidentally said “sorry i’m not a fan of children”"}, {"text": "i think i’ll spend the day imagining the worst"}, {"text": "body negativity"}, {"text": "oh fuck i’m having a memory"}, {"text": "but i love setting myself up for disappointment"}, {"text": "if you can’t handle me at my insomnia all night then you don’t deserve me at my sleeping all day"}, {"text": "having carefully read your tweets, i’ve reached the conclusion that you’re all very annoying"}, {"text": "for the love of god can someone just get me out of my body"}, {"text": "*whispers during sex* i hate having a body"}, {"text": "BIG DEATH ENERGY"}, {"text": "i’ll be at symphony space tomorrow nighthttps://twitter.com/GuernicaMag/status/1039574513112047616 …"}, {"text": "obsessing over a problem that doesn't exist"}, {"text": "when is my new body scheduled to arrive"}, {"text": "We'll be hosting our first book club on 9/17 at Picture Room in Brooklyn where we'll be discussing THE PISCES by @melissabroder in conversation with #NYCPasserby @fariharoisin. Join us!http://www.passerbuys.com/events/passerbuys-book-club-the-pisces-by-melissa-broder …"}, {"text": "i hope my obituary is good"}, {"text": "if i don't love myself by now it's not gonna happen"}, {"text": "body type:\nnot great"}, {"text": "oh fuck i woke up"}, {"text": "stop peer pressuring me not to torture myself"}, {"text": "new episode of my podcast (yes i have a podcast) about taco bell and deathhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000419432764 …"}, {"text": "[flirting] I’m but a vessel for an ancient trauma"}, {"text": "excited for my expectations to turn into resentments"}, {"text": "i don't have to prove anything to anyone! (except the negative voices in my head and anyone who ever rejected me)"}, {"text": "is body dysmorphia still body dysmorphia if i’m actually gross?"}, {"text": "i miss you never contact me again"}, {"text": "cause of death: couples calling each other \"babe\""}, {"text": "i’m officially done growing as a person. thank you."}, {"text": "i’m definitely getting grosser"}, {"text": "writing is so isolating which is why it’s my sport"}, {"text": "lil excerpt from what will be my next novel...or my next next novel... hehepic.twitter.com/6vEtOMf2Kq"}, {"text": "sorry, i can't, i'm busy watching everything get worse"}, {"text": "one small positive thought in the morning can disappoint the shit out of you for the rest of the day"}, {"text": "sorry but i hate everything more than you do"}, {"text": "i'll give me something to cry about"}, {"text": "the good thing about never expressing my needs is no one knows how crazy they are"}, {"text": "i'm 44% sex dreams, 56% cereal"}, {"text": "blood type: self-doubt"}, {"text": "I’m sorry but reality is bullshit"}, {"text": "what do you mean the universe can't just cater to my every desire?"}, {"text": "i feel like everyone who follows this account knows i have a podcast, but then people are like ‘wait you have a podcast?’ \n\nanyway new episodehttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=ce3d4421-0042-40d5-9170-88dfa96dfa3a …"}, {"text": "i’ve made the big leap from no self-esteem to very low self-esteem"}, {"text": "my body is a hotel for anxiety"}, {"text": "sleeping all day speaks louder than words"}, {"text": "my attitude was good for two minutes"}, {"text": "my self-hatred is organic"}, {"text": "i'm cool when i'm alone"}, {"text": "*makes emotional progress*\n\n*throws it in the trash*"}, {"text": "i eat existential dread for breakfast"}, {"text": "you better not get over me"}, {"text": "trying to get excited about my inner beauty"}, {"text": "internet: we NEED to talk about-\n\nme: nah"}, {"text": "great, more bad art"}, {"text": "hey guys for my birthday next week can u pls just stop"}, {"text": "https://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559 …pic.twitter.com/n2MmjAgEJ8"}, {"text": "pretending i forgot about you"}, {"text": "i'm good at feeling like shit"}, {"text": "well my blood has turned to cereal"}, {"text": "planet earth isn't my first choice"}, {"text": "is this nauseous feeling life or death"}, {"text": "studies confirm i hate everything"}, {"text": "it's not you it's the mediocrity of reality"}, {"text": "if you like death you'll love...me"}, {"text": "Voici un premier extrait de So Sad Today en français ! Le livre paraîtra aux @EdLolivier en janvier pic.twitter.com/tcmyTRnPke"}, {"text": "anxiety or it didn't happen"}, {"text": "i want my cremation urn to have wi-fi"}, {"text": "oh no i felt a feeling"}, {"text": "i need a new mind and a new body"}, {"text": "get attached to me"}, {"text": "https://www.votetexas.gov/register-to-vote/ …pic.twitter.com/ARuCBJwcg1"}, {"text": "i'm an entrepreneur of ways to feel shitty"}, {"text": "dudes in my phonepic.twitter.com/oQsGFHJN5p"}, {"text": "for every one hour i spend with people it takes me four to recover"}, {"text": "i'm basically just a nap waiting to happen"}, {"text": "*whispers during sex* trust no politician"}, {"text": "self-destructive in a gentle way"}, {"text": "yesterday my mom called me and i just started yelling about how i want my funeral to be"}, {"text": "i love comforting myself with compulsive behaviors"}, {"text": "i might not like anyone"}, {"text": "curing loneliness with isolation"}, {"text": "as long as i die instantaneously i’m totally fine with any kind of death"}, {"text": "might be eating alone in a rental car for a bit"}, {"text": "this morning a dude reversed his jeep without looking, hard, smashing into my car, then said “sorry i’m having a bad day”"}, {"text": "feeling a bit...sad"}, {"text": "i don't have fear of missing out, i have fear of being invited"}, {"text": "We're launching LitProv as part of @BKBF Bookends on Sept. 13th with @rakeshsatyal, @dulcesloan, @PlanetofFinks, @sosadtoday & @mrdavehill! Don't miss out: https://bit.ly/2OdiknC pic.twitter.com/XwncqTG84N"}, {"text": "good morning and welcome to the terror of being alive"}, {"text": "sext: writing bad poetry about you"}, {"text": "“i’m disgusting” -me doing positive affirmations"}, {"text": "when someone believes in me i'm like what's wrong with you?"}, {"text": "was awake for an hour so it's time to go back to sleep"}, {"text": "i regret everything"}, {"text": "happiness is cancelled"}, {"text": "today’s tweets sponsored by denial, escapism, and an inability to be still with myself or face reality"}, {"text": "when i shed the remnants of these ineffectual coping mechanisms i’m still clinging onto like the side of a sinking ship it’s over for you bitches"}, {"text": "when i stop trying to crawl back to the womb it’s over for you bitches"}, {"text": "mom: happy birthday \nme: what the fuck were you thinking?"}, {"text": "it’s my birthday assholes, read my books. thxhttps://twitter.com/sosadtoday/status/1012901697587277826 …"}, {"text": "if you don’t like me i'm obsessed with you"}, {"text": "Most suspicious of the person who performs good person on the internet"}, {"text": "i keep getting older and it's not good"}, {"text": "wanna come over and compare suffering?"}, {"text": "overwhelmed by most stuff"}, {"text": "95% of my ideas are bad and the other 5% i don't act on"}, {"text": "i’m old and gross"}, {"text": "it’s my birthday tomorrow — as a gift can someone photoshop the weird white tag out of this pic, i need a new old age-updated avatar for my @melissabroder account, thx pic.twitter.com/386NsAHDzN"}, {"text": "i only want to talk about sex, death and cereal"}, {"text": "horoscope: more mistakes coming soon"}, {"text": "if you aren't thinking about me you should be"}, {"text": "text me back to tell me you're not going to text me back thx"}, {"text": "brb, wasting my life"}, {"text": "my anxiety will outlive me"}, {"text": "if you like my tweets you’ll...maybe like my podcast but probably find it annoyinghttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000418547745 …"}, {"text": "not going to get attached\nnot going to get attached \nnot going to get attached \n*gets attached*"}, {"text": "my mind wants me dead but it's fine"}, {"text": "just gonna do this to make sure it's still a bad idea"}, {"text": "despite all my rage i am still conflict averse"}, {"text": "              \nhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000418547745 …            "}, {"text": "annoyed that the church of satan has branded the pentagram, like let satan be free! satan belongs to all of us!"}, {"text": "decided to just start posting pentagrams"}, {"text": "no i don't want you to be happy"}, {"text": "in my phone your name is NO"}, {"text": "if i can't torture myself about it i don't want to be involved"}, {"text": "tell society not to talk to me"}, {"text": "oh great another day"}, {"text": "me during sex: hurt me\n\nher: you're a few days too slow to this meme, and too early to be ironically late. your meta posts are derivative and uninspired. it's too mainstream to be cool, and not enough to give you the recognition you crave outside of this platform's dying audience"}, {"text": "never getting over anything"}, {"text": "public displays of fake empathy"}, {"text": "Author Melissa Broder on \"The Pisces\" and purpose by Sofia Sears http://bit.ly/2obKAeN  #adolescentcontentpic.twitter.com/RnbnUxbco2"}, {"text": "people: just be yourself \n\nme: who is that?"}, {"text": "should i make it prettier or uglier"}, {"text": "how do i make my Instagram less of a piece of shit, my ocd is flaring\n\nhttps://www.instagram.com/realmelissabroder/ …"}, {"text": "crying in supermarkets is an art"}, {"text": "society: hi\nme: no"}, {"text": "not equipped to handle life and don't really want to get equipped"}, {"text": "when i learn how to live in the world it's over for you bitches"}, {"text": "i hate everything in a nice way"}, {"text": "myth: parties are fun"}, {"text": "i want to be banned from myself"}, {"text": "if you've subtweeted one boy you've subtweeted them all"}, {"text": "[political tweet]"}, {"text": "When I’m watching porn and he doesn’t eat her pussypic.twitter.com/7HLjuyXRcH"}, {"text": "i think i have, like, extra feelings"}, {"text": "brooklyn i’m coming to @SymphonySpace \n\ndoing LitProv, hosted by @rakeshsatyal with @PlanetofFinkshttp://bit.ly/2OdiknC "}, {"text": "we should lose hope together"}, {"text": "by relaxed i mean very anxious"}, {"text": "i don't know how to live in the world"}, {"text": "hobbies include just deciding that people no longer like me"}, {"text": "books can change your heart / mind <3pic.twitter.com/tW2i94peiY"}, {"text": "everybody wants you to be as crappy and boring as them"}, {"text": "i never know what i'm feeling because i don't want to"}, {"text": "memories are trying to kill me"}, {"text": "person: can i be a guest on your show?\n\nme: you mean my show called eating ALONE in my car?"}, {"text": "let’s pretend i’m alt"}, {"text": "i love that my show isn’t monetized, it makes me feel alt"}, {"text": "another fucking episodehttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=0d550eef-4848-c45e-a2b0-bcbf118f60f0 …"}, {"text": "embarrassed to be alive"}, {"text": "i give really good advice to everyone except me"}, {"text": "When I’ve had the appropriate amount of targeted trauma therapy it’s over for you bitches"}, {"text": "want to sleep for 100 days and wake up and eat 100 days worth of food"}, {"text": "my heart is stupid"}, {"text": "hello childhood defense mechanism my old friend"}, {"text": "two roads diverged and i took the one where i didn’t have to feel shit"}, {"text": "so done with porn\n\n*watches porn*"}, {"text": "i always forget i have depression and believe my thoughts are an objective truth regarding the certainty that i am fucked"}, {"text": "when i'm simultaneously trying to get attention and hide from the world that's the real me"}, {"text": "hobbies:\n-being left alone"}, {"text": "what's this? oh it's my emotional baggage"}, {"text": "oh no i’m alive"}, {"text": "me trying to have boundariespic.twitter.com/GAZqstV5o5"}, {"text": "oops, the reasons i created for staying alive are trying to kill me"}, {"text": "liked myself for two seconds and then didn't again"}, {"text": "gave up on everything but then forgot to stay given up"}, {"text": "*whispers during sex*pic.twitter.com/JrY4Gk2XiA"}, {"text": "i make the most beautiful problems for myself"}, {"text": "sorry that my suffering isn't the right brand"}, {"text": "fall asleep on the dick"}, {"text": "if you’re fucked up right now just impulse-buy this, thxhttps://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559 …"}, {"text": "great, i'm alive and filled with longing for things that don't exist"}, {"text": "high on insecurity"}, {"text": "i like to not do anything about my problems but still worry about them"}, {"text": "i was rejected by my mother for eating cake as a child #ShareYourRejection"}, {"text": "so what if my most intimate relationship is with a cake"}, {"text": "i'm hungry but not sure if i deserve to exist: the musical"}, {"text": "eating and masturbating"}, {"text": "actually bitch i’m 85 years oldhttps://twitter.com/honeygeryon/status/1029484619379482626 …"}, {"text": "small talk requires 100% more energy than making out"}, {"text": "people: don’t joke about depression\n\nme: would you prefer i cry about it?"}, {"text": "*whispers during sex* it’s not that i think the world would be better without me but that i’d be better without the world and that it wouldn’t matter if i was gone"}, {"text": "sometimes i forget i have depression and it’s  like why am i built like a strainer where all the positive stuff drips out and the self-hatred stays in?"}, {"text": "what's wrong with me? asking for a friend"}, {"text": "new episode of my “show”https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000417703908 …"}, {"text": "\"i'm a fucking loser, i'm nothing\" -me trying to do positive affirmations"}, {"text": "whatever i'm doing i'm actually crying"}, {"text": "it’s a beautiful day i feel like dying"}, {"text": "if i'm relatable you're fucked"}, {"text": "horoscope: you shouldn't text him but you will"}, {"text": "maybe if i buy this shit i don't need i'll be a whole person"}, {"text": "sorry, i know we're having sex but i'm can't stop thinking about mean things people might be saying about me: a memoir"}, {"text": "sext: let's be honest, you didn't like me as much as i liked you"}, {"text": "this is so fascinating and relatable *points to death*"}, {"text": "i either think about you or think about death"}, {"text": "oh cool, society is still gross"}, {"text": "do you control your fear or does your fear control you?!\n\nmy fear controls me."}, {"text": "being invited to a party is an act of war"}, {"text": "me: i'm dying\nme: you're not dying\nme: i'm dying\nme: you're not dying\nme: i'm dying"}, {"text": "i'm scared of people, loneliness, being too much, not being enough, intimacy, rejection, dying, and being alive"}, {"text": "the shit that scares you probably won't happen but other bad shit definitely will"}, {"text": "now researching: what's wrong with me?"}, {"text": "\"look on the bright side\"\n\n\"no\""}, {"text": "time doesn't really heal anything but sometimes you find someone new to obsess about"}, {"text": "i came, i saw, i blamed myself for everything"}, {"text": "let's feel bad for each other"}, {"text": "“I love your energy” is what you say when you hate somebody"}, {"text": "quoth the raven, don’t text him"}, {"text": "currently listening to: me telling myself i'm a piece of shit"}, {"text": "5% actual evil coursing thru my veins ugh"}, {"text": "you have to learn to love yourself\n\nyeah sorry no"}, {"text": "it's important to be a mess"}, {"text": "I think I’ve entered the wrong world."}, {"text": "current mood: fucked"}, {"text": "well i'm not enough"}, {"text": "i was supposed to be hotter"}, {"text": "talked about breaking up the abyss with little meaningless hits of dopamine, 7-11, and my sobrietyhttps://itunes.apple.com/us/podcast/ep-32-sober-living-with-melissa-broder/id1329229319?i=1000417478741&mt=2 …"}, {"text": "Not only did we get to chat with @sosadtoday on our new episode, but we also gave book recs!https://itunes.apple.com/us/podcast/forever35/id1329229319?mt=2&i=1000417478741 …"}, {"text": "being alive is a major problem"}, {"text": "sometimes i forget i have depression and it’s like is everyone else just pretending they aren’t horrified that they exist"}, {"text": "waiting for a text seems like a legit career"}, {"text": "might start an anonymous twitter"}, {"text": "i didn’t know the revolution would be so boring"}, {"text": "text me back: the musical"}, {"text": "i fall in love every ten seconds"}, {"text": "life's a bitch and then you think it's maybe going to be okay for a sec and then it's a bitch again"}, {"text": "gonna go give a blow job"}, {"text": "\"get it together\" --my dog"}, {"text": "babypic.twitter.com/ts0IJxVlEH"}, {"text": "things i'm good at: \nnot knowing when to stop"}, {"text": "i have a headache, probably because i exist"}, {"text": "Anxiety is a clue that your body can feel what your mind is finding hard to comprehend."}, {"text": "Decide if a life with people is right for you"}, {"text": "oh look it’s a hell of my own making"}, {"text": "i really liked you. i mean, I didn't but everyone else is worse"}, {"text": "in a committed relationship with insomnia"}, {"text": "shit can't get worse\n\n*shit gets worse*"}, {"text": "just sitting here quietly thinking I'm a loser"}, {"text": "human existence has always been a disaster so at least there's that"}, {"text": "what you call “producing” i call “i downloaded some free apps infected with spyware that cut mp3s in half and stitch them back together”"}, {"text": "this show is 100% diy, that’s right folks, i eat the shit, i say the shit, i record the shit, i edit the shit, i produce the shit, and i have no idea what the fuck i’m doing and you can totally tellhttps://twitter.com/sosadtoday/status/1026301596903211008 …"}, {"text": "the question is not if i am a loser but how big of a loser"}, {"text": "i'll show you my emptiness if you show me yours"}, {"text": "horoscope: why bother?"}, {"text": "this account is so 2012"}, {"text": "share a coke with social anxiety"}, {"text": "https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=f36ad52e-0f7e-887b-130b-023885967b6b …\nhttps://open.spotify.com/episode/7KljafMLdfoZoUVrQO5EMr?si=NdKE5LydS3GP2GBaeSaRKQ …pic.twitter.com/WLLUFbbSgH"}, {"text": "i have the wrong piercings, hair color, clothes, body and mind"}, {"text": "hope someone flirts w me at the cemetery"}, {"text": "\"just wanna get this over with\" -me about everything"}, {"text": "leaving the house and other bad ideas"}, {"text": "there are so many hot people i'm so upset"}, {"text": "Sois gentil avec les gens mais aussi essaye d’éviter les gens"}, {"text": "« Dois-je manger, dormir ou me masturber ? », la comédie musicale"}, {"text": "first name existential last name crisis"}, {"text": "i can't understand people who don't feel like they are dying every single day"}, {"text": "had a feeling and buried it in under 1 second"}, {"text": "that which does not kill you but makes you slowly retreat from the world"}, {"text": "hypersensitive before it was cool"}, {"text": "TED talk about staying in bed"}, {"text": "high on loneliness"}, {"text": "*whispers during sex* i’m insecure so sometimes i retweet my own tweets and then un-retweet"}, {"text": "well well well if it isn’t excruciating self-doubt"}, {"text": "in a relationship with a muffin"}, {"text": "i came, i saw, i got rejected"}, {"text": "my first reaction to anything is oh no"}, {"text": "today i heard: “yeah they gave everyone working here a water bottle because they banned straws also they’re laying off all the kitchen staff but they brought in street artists to tag people’s water bottles so that’s why they’re lining up”"}, {"text": "me: consumerism is poisoning my soul\n\nme: omg i need all this shit i don’t need"}, {"text": "breaking news: still don’t love myself"}, {"text": "let’s just call it capitalist self-indulgence and leave “self-love” alone"}, {"text": "there are two kinds of people in this world and i don’t understand either of them"}, {"text": "let me down in a more exciting way"}, {"text": "sorry that instead of responding to what you were talking about, i simply glowed with a diffuse primrose light before exploding into a billion particles, eventually spreading to the ends of the universe before contracting back into my human form, by which point you had moved on"}, {"text": "in a complicated relationship with the amount of shit i have to do just to stay alive"}, {"text": "please keep society away from me, thx"}, {"text": "my aesthetic is fear and anxiety"}, {"text": "spoiler: your parents fucked you up"}, {"text": "i'm a bad movie"}, {"text": "i always feel like i'm bleeding psychologically"}, {"text": "horoscope: oopsy"}, {"text": "The Pisces by Melissa Broder review – my boyfriend, the mermanhttps://www.theguardian.com/books/2018/aug/01/pisces-melissa-broder-review-merman?CMP=twt_books_b-gdnbooks …"}, {"text": "would prefer if my actions didn’t have consequences"}, {"text": "taste the depression"}, {"text": "trust your heart just kidding"}, {"text": "the today show has discovered THE PISCES. don’t let hoda be more lovesick than you.https://twitter.com/emmastraub/status/1024281698824060929 …"}, {"text": "hated everything before it was cool"}, {"text": "If you were to take a potato and plug one end into an iPhone charger and the other into an outlet you would literally get a clone of me"}, {"text": "\"still obsessed with you\" --my tombstone"}, {"text": "one time i tried to be positive and it was a disaster"}, {"text": "woke up\nconfirmed i hate everything \nwent back to bed"}, {"text": "i know some of you fear the podcast is haunted bc itunes says “59 seconds” and then it plays for 30 min\n\nthis is bc idk what the fuck i’m doing & i edit it using weird free apps\n\nbut fear not! i found a better free app & next week’s will be fixed\n\nalso, the podcast may be haunted"}, {"text": "i miss the illusion of you"}, {"text": "   https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=63130d77-da7e-7ff8-59d7-c6437c971e4c …\n  https://open.spotify.com/episode/5h9pvz1X4nq7u3TMDBzIlw?si=O54OJFJHSWS4vqdw21CwnQ …\n   "}, {"text": "same anxiety different day"}, {"text": "i'm not the most excited about being alive today"}, {"text": "treat everyone with kindness but also try to avoid everyone"}, {"text": "people: where can i get your books?\n\nme: under the hoof of a magic truffle pig on a mysterious island known only to three witches. also amazon and bookstores."}, {"text": "in a committed relationship with my obsessive thinking"}, {"text": "what's wrong with me: the musical"}, {"text": "you should read this bookpic.twitter.com/zU7lYUtnNk"}, {"text": "the last person who made me cum has me blocked on IG"}, {"text": "i always think everything bad is about me"}, {"text": "my superpower is my mother only loved me conditionally"}, {"text": "i think i've been alive too long"}, {"text": "Ugh do I actually have emotional intelligence or do I just want people to like me :/"}, {"text": "be yourself\"\nbut i don't like myself"}, {"text": "sext: let's sleep for 100 hours"}, {"text": "a group of people is called an annoying"}, {"text": "\"i'm definitely dying\" -me every second"}, {"text": "I’m almost 40 and the only item left on my bucket list is not to apologize when someone bumps into me."}, {"text": "are you coming to this in 5 hours? "}, {"text": "i realized i was awful and then i realized it again"}, {"text": "i wouldn’t follow me"}, {"text": "me and @alexdimitrov tomorrow @BookSoup come thru pic.twitter.com/Gwa0H3v4Ti"}, {"text": "when i'm by myself i'm almost ok"}, {"text": "live, laugh, love, confuse lust with love, diagnose yourself with fatal illnesses"}, {"text": "everyone sucks"}, {"text": "fears within one hour of waking:\n-i’m not enough \n-it’s all over for me\n-i’m doomed \n-my dumb attempts to construct meaning are a delusion\n-i will one day face a day of reckoning \n-everyone sees through me\n-the universe thinks i’m bad\n-i don’t have a wet enough vagina"}, {"text": "i almost feel bad for people who can't synthesize their intellect into dark humor to mask their crippling insecurity"}, {"text": "sad today"}, {"text": "want to throw myself in the trash in a creative way"}, {"text": "*sext* sometimes i get scared that way more people hate me than i’m aware of"}, {"text": "i've never fit in and it's like thank fucking god"}, {"text": "i'm not thinking positively and it's fine"}, {"text": "i like to blame myself for everything just in case"}, {"text": "existence is a major inconvenience"}, {"text": "i don't give a fuck but i totally do"}, {"text": "wonder if i’ll win any literary awards or receive any grants in my lifetime?"}, {"text": "should i just pee in my pants rn"}, {"text": "see you friday san diegohttps://twitter.com/juliadixonevans/status/1022237045907906562 …"}, {"text": "*sinking feeling gets heavier*"}, {"text": "brb, attempting to fill the aching void with shit that will only make it bigger"}, {"text": "much love to all my fellow alcoholics and addicts out there: those in sobriety and those who are still working on their story"}, {"text": "my latest for .@byshondaland if you need a book to fall in love with this summer https://www.shondaland.com/inspire/books/a22521928/summer-love-books/ …"}, {"text": "most of my feelings are a disease"}, {"text": "if it's something stupid i've probably done it"}, {"text": "i loved it when i didn't know you"}, {"text": "i wish i was more not me"}, {"text": "i call it a “show” because i’m ashamed to say “podcast”"}, {"text": "this is your new favorite show"}, {"text": "life is the worst phase"}, {"text": "new episode of my show: eating alone in my car  FROSTED FLAKES  https://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2 …  https://open.spotify.com/episode/4EpPFx2b5XcCVEAWPbwczP?si=yVgJpkeXSZSdOk_PqWqgHg …   "}, {"text": "current emotion: no"}, {"text": "what should my next mistake be"}, {"text": "yeah no shit i'm trying too hard"}, {"text": "one time i was optimistic and it did not go well"}, {"text": "self-respect seems like an illusion"}, {"text": "i am a cult leader and my cult is my dog and my bed"}, {"text": "i have a headache so i’m obviously dying"}, {"text": "the emptiness has arrived"}, {"text": "what are the best bookstores in houston, austin & dallas? and boston"}, {"text": "if i were gonna come to a few more cities i haven’t done (so not la, chicago, sf, nyc, dc, philly, portland) where shld i go"}, {"text": "doing shit next weekend in san diego and los angeles come thrupic.twitter.com/m13A7VkvIa"}, {"text": "being an adult sounds really bad"}, {"text": "\"scared you don't like me\" -me about everyone"}, {"text": "be in love with my low self-esteem"}, {"text": "weekend plans:\n-regret past\n-fear future"}, {"text": "sorry i tried to use you as an antidepressant"}, {"text": "sorry i called you an npr tote bag in my head"}, {"text": "let's not get together"}, {"text": "music i likehttps://open.spotify.com/user/atomicyente/playlist/46XpknvvC5ESCkEd3Nmk4O?si=If2UoufKSm6_-aNJ61X4HQ …"}, {"text": "i keep meaning to be a different person"}, {"text": "so what if i i’m home masturbating to ursula the sea witch on a friday night"}, {"text": "I wrote about the two best fantasy novels of the summer.https://www.buzzfeednews.com/article/mariskreizman/ottessa-moshfegh-melissa-broder-wellness-self-help …"}, {"text": "every time someone cancels plans an angel gets its wings"}, {"text": "i'll see your fake positivity and raise you a genuine cynicism"}, {"text": "trust the universe (to eventually kill you)"}, {"text": "my dog is special, your kid is whatev"}, {"text": "In @sosadtoday's The Pisces and Otessa Mosfegh's My Year of Rest and Relaxation, self-destruction is a welcome respite from the self-improvement industrial complex, writes @mariskreizmanhttps://www.buzzfeednews.com/article/mariskreizman/ottessa-moshfegh-melissa-broder-wellness-self-help …"}, {"text": "i’m not dead inside but it sounds so beautiful"}, {"text": "posted a video of me peeing so i guess i’m truly an influencer now!"}, {"text": "one month and it’s still stupid"}, {"text": "accidentally got some vulnerability on me"}, {"text": "i want to not give a fuck what anyone thinks of me and for everyone to love me"}, {"text": "i hate everything in a whole new way"}, {"text": "sorry i turned you into a drug"}, {"text": "sry the patterns I carved out of raw chaos, at the behest of a vast & all encompassing biological imperative, didn’t include the various swells of hormones that masquerade as love in the oppressive popular discourse our species calls culture"}, {"text": "sorry I called your straw-free cantina a neoliberal mirage"}, {"text": "s/o to the glacial pace of forgiveness"}, {"text": "it was the best of dicks, it was the worst of dicks"}, {"text": "you should love me for me even though i totally don't"}, {"text": "don't give up on me, or do it's fine"}, {"text": "being infatuated with you has been a real pleasure"}, {"text": "i love your dick i mean art"}, {"text": "i'm tired of being strong and i'm not even strong"}, {"text": "bro does the abyss even gaze back at you"}, {"text": "stop peer pressuring me to love myself"}, {"text": "me and alex will be talking about astrology, death, poetry & twinks at @BookSoup in LA on saturday july 28 at 5 PM  we will also be reading & signing  there will be $10 tarot readings  thank you.https://twitter.com/alexdimitrov/status/1019243477333413888 …"}, {"text": "*note there is a “musical performance” (written, directed & performed by me) in this episode entitled Twitter Moralism: The Musical!"}, {"text": "the anxiety is present"}, {"text": "new episode of my show (i have a show called “eating alone in my car” where i eat alone in my car)\n\ntoday’s topics: depression, anxiety, depression & anxiety\n\nhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000415901092 …\nhttps://open.spotify.com/episode/4dIYG5zHR07lmr1gcnqYPY?si=Bs5Gm3lZQkuWHg-fc5u-SQ …"}, {"text": "All this effort & we’re just some random bitches in a random galaxy"}, {"text": "when something good is about to happen i feel like it's already over"}, {"text": "when being alive isn't working"}, {"text": "hi i'm mediocre"}, {"text": "“everyone looks like a fake plastic doll now” -me wishing i looked like a fake plastic doll"}, {"text": "“when is this phase going to be over?” -me about everything"}, {"text": "oh no a person is trying to talk to me"}, {"text": "\"i don't need that in my life\" --me about everything"}, {"text": "catastrophic thinking & fearing the future, crushes on strangers & blaming myself for everything, these are a few of my favorite things"}, {"text": "i’m just not that into me"}, {"text": "looking for dopamine in all the wrong places"}, {"text": "https://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559 …pic.twitter.com/sgM7iHElTZ"}, {"text": "oh no i exist"}, {"text": "don't invite me unless it's sleep"}, {"text": "meet me at the corner of insomnia and difficulty living in the world"}, {"text": "many classic works of literature don’t have enough pussy eating"}, {"text": "when people flirt with me i'm like can i get that in writing"}, {"text": "if you try to involve me in your 'journey of self discovery,' i  will call  the  police  on  you "}, {"text": "all my life i was told i just needed to pray more which is why i now begin every day by looking up at the sky and screaming THANK YOU GOD FOR MAKING ME THE GAYEST BITCH ALIVE"}, {"text": "  new episode of my show: eating alone in my car   where i eat alone in my car  \nhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000415524707 …  https://open.spotify.com/episode/2cQz4fSGbKuWg0WvLnPh7S?si=7ezZE9CbQKmAVeraz1kuBg … "}, {"text": "i'm not good enough for me"}, {"text": "when i see people reproducing i'm like what are you doing"}, {"text": "PSA - just because you miss someone doesn’t mean you should reach out to them"}, {"text": "being my own worst enemy is going ok"}, {"text": "retweeting myself for dopamine like the punk i fucking am"}, {"text": "having a threesome with love and death"}, {"text": "don't obsess about it\n\nyeah ok thanks you fixed me"}, {"text": "dopamine speaks louder than words"}, {"text": "oh god another day"}, {"text": "it's all fun and games until you're born"}, {"text": "phd in preparing for people to spontaneously stop liking me"}, {"text": "at least i'm not permanent"}, {"text": "what if i'm the worst?"}, {"text": "Dancing Queen by ABBA is about death."}, {"text": "when I was 20 I took a pic of me and my ex-bf and showed it to my therapist and asked him if it looked like he was still in love with me. he said yes!"}, {"text": "i’m always surprised when i like people"}, {"text": "i have a headache, probably from being confronted with my own cosmic insignificance"}, {"text": "it's my body and i'll shame it if i want to"}, {"text": "if i get reincarnated i'm gonna be like are you fucking kidding me?"}, {"text": "i love you but i've chosen masturbation"}, {"text": "how do I know if I understand social cues"}, {"text": "can't tell if i'm about to suffocate, cry, puke, fall asleep, die or become enlightened"}, {"text": "i don't like anything related to reality"}, {"text": "3 hours "}, {"text": "why is everyone named Caitlin?"}, {"text": "see u in 5 hours brooklynhttps://twitter.com/sosadtoday/status/1015785126721146880 …"}, {"text": "going with #2, thank you all for your guidance and wisdom"}, {"text": "i have trouble expressing my feelings except to the whole internet"}, {"text": "“we’re very intimate, very close friends” -me about the total strangers i randomly follow on here"}, {"text": "breaking news: i'm feeling compulsive"}, {"text": "i'll be the cruel judge of me, thanks"}, {"text": "should i wear:\n1. pleather shorts & black tank top that shows bra\n2. a romper & dad sneakers\n3. jorts & a belt with a leopard on it"}, {"text": "this better not be the prime of my life"}, {"text": "hi i’ll be in brooklyn tomorrow at @booksaremagicbk  3-5 PM giving personalized love advice, signing books, and hanging out  come thru"}, {"text": "being just friends is a nightmare"}, {"text": "going back to bed forever"}, {"text": "made the mistake of waking up"}, {"text": "if there’s one thing worse than having to die it’s being born"}, {"text": "shit is on spotify now https://open.spotify.com/show/3AxeWHyeLI4F6ovYjfW7HT …https://twitter.com/sosadtoday/status/1014549236103274496 …"}, {"text": "beautiful things:\n-shutting the fuck up"}, {"text": "concept: a quick and painless death in my sleep"}, {"text": "got my self-esteem at the dollar store"}, {"text": "are you more in love with the person or the fantasy of the person?\n\nthe fantasy, obvi"}, {"text": "i hate that we had a connection"}, {"text": "turn-offs include waking up"}, {"text": "almost two decades later, I have finally purchased “smooth” by santana featuring rob thomas for one dollar and twenty-nine cents on itunes."}, {"text": "don't mind me i'm just making the same mistakes and expecting diff results"}, {"text": "everyone over there looks like they are really enjoying life today, it’s so bad"}, {"text": "holidays hurt my feelings"}, {"text": "why are people doing stuff?"}, {"text": "today in history: i felt anxious"}, {"text": "she’s seriously the best.https://twitter.com/jivedurkey/status/1014611029312065536 …"}, {"text": "fucking love her.https://twitter.com/ajplus/status/1014625311906918400 …"}, {"text": "my gift to humanity is not having kids"}, {"text": "in america we like shopping and shooting people"}, {"text": "Nah. Not today."}, {"text": "fuck you"}, {"text": "just felt a flicker of self-esteem and was like what the fuck is this"}, {"text": "no offense but i'm glad you're all going to die too"}, {"text": "i have a “show” called “eating alone in my car” where i eat alone in my car\n\nnew episode: a mcflurryhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2#episodeGuid=3df1a0e7-6951-5984-a07d-cb715874d949 …"}, {"text": "studies show that i'm the worst"}, {"text": "that will only cause you pain\n\nok cool i'm gonna do it!!!!"}, {"text": "loving you was an illness"}, {"text": "why are people always asking questions where they assume you have a life?"}, {"text": "lied to an uber driver that i have fourth of july plans because i felt like he wanted me to"}, {"text": "remember when i thought I knew you but I didn't know you at all"}, {"text": "every time i post i go into a shame spiral and delete it, is that what’s supposed to happen"}, {"text": "one time i was happy and it made the next day worse"}, {"text": "summer beauty secret:\ndon't bother"}, {"text": "i'm in love with 50 people and also none"}, {"text": "no i don’t have any “fun summer plans”"}, {"text": "i don’t like me"}, {"text": "i didn't choose the depression life the depression life chose me"}, {"text": "can’t believe i’m still tweeting from this damn account"}, {"text": "welcome to anxiety, sponsored by depression"}, {"text": "this always makes me feel like shit so i'm gonna do it"}, {"text": "i’m doing more shitpic.twitter.com/Duko8r9nHZ"}, {"text": "your positivity feels like a lie"}, {"text": "things i can emotionally handle:\n-cereal"}, {"text": "studies show that everything sucks"}, {"text": "https://www.amazon.com/Pisces-Novel-Melissa-Broder/dp/1524761559 …pic.twitter.com/TTEUkyVvK3"}, {"text": "all my goodbyes are happy because i just want to get the fuck out of there"}, {"text": "never change for anyone unless they are really hot and ignoring you"}, {"text": "bring your own serotonin"}, {"text": "*never gets shit together*"}, {"text": "i miss the things that destroyed my life before they destroyed my life"}, {"text": "for those of you who wish my tweets were longer, wordier, and could be purchased online or at your local bookstore, i have good news...pic.twitter.com/PqUHm9ItPr"}, {"text": "have you read this yet?"}, {"text": "i hate everything in a peaceful way"}, {"text": "Birth announcements seem like onion articles now"}, {"text": "why am i happening?"}, {"text": "oh god i'm awake"}, {"text": "another night, another compulsive behavior"}, {"text": "let's roleplay you not being an asshole"}, {"text": "just checking to make sure you're still not in love with me"}, {"text": "hello from across the infinite chasm of meaninglessness"}, {"text": "me: did i take my meds?\n\nalso me: i took my meds\n\nalso me: did i take my meds?"}, {"text": "tired but tired"}, {"text": "i'm becoming who i was always meant to be but shittier"}, {"text": "pic.twitter.com/TbchUGhXN4"}, {"text": "no i can't just \"be chill\""}, {"text": "new episode of my “show” lolhttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000414767942 …"}, {"text": "sometimes i'm like maybe i don't have depression anymore and then i do"}, {"text": "the universe is annoying"}, {"text": "i had a sex dream about a buffet"}, {"text": "par \"heureuse\" je veux dire \"modérément dépressive\""}, {"text": "horoscope: uh oh"}, {"text": "it's like i always say: fuck"}, {"text": "i don’t want to be who i am"}, {"text": "tony the tiger - big dick energy \ntoucan sam - no\ncap’n crunch - no\nhoney snacks frog - big dick energy\nlucky charms elf - no\njared from subway - no\nmicrosoft paperclip - yeah\nronald mcdonald - no\ncount chocula - no\nfrankenberry - big dick energy"}, {"text": "if i do my eyebrows right will i be whole"}, {"text": "i have one good selfie and it's from five years ago"}, {"text": "I’m having an emergency, I think my ex boyfriend became a meme"}, {"text": "when people call me “queen” or “mom” i get way too excited because i lack a core sense of self-esteem"}, {"text": "people on instagram will like anything"}, {"text": "i may seem like that cool writer from NY to everyone else but to my hometown i'll always be the kid who left boston market in a stretcher, twice"}, {"text": "is being alive a meme?"}, {"text": "been awake ten minutes and already regret today"}, {"text": "my beautiful, dark, twisted cap’n crunch fantasy"}, {"text": "moi : fuck les haters\n\nmoi également : les haters ont tellement raison"}, {"text": "je suis venue, j'ai vu, j'ai déprimé"}, {"text": "yes, please do fuck with my head"}, {"text": "i hate myself so easily"}, {"text": "these books r goodpic.twitter.com/WyvrdgR1Y6"}, {"text": "the insightful posts you’ll find on my “insta”pic.twitter.com/JlxSa5amB8"}, {"text": "whoops, hurt myself conforming to socially accepted standards of beauty that i know are false but still feel compelled to fit into"}, {"text": "do you want the real version or the fake version of how i'm doin"}, {"text": "what you call a nervous breakdown i call oops, accidentally saw things as they are"}, {"text": "waking up today was a disappointment"}, {"text": "this too shall pass and come back worse"}, {"text": "tell the things i once enjoyed that i say hey"}, {"text": "sext: i'm ashamed of how much i tweet"}, {"text": "that which does not kill you but makes you seek validation from total strangers online"}, {"text": "that which does not kill you but makes you cling to harmful defense mechanisms like a soft blanket"}, {"text": "that which does not kill you but makes you misinterpret every situation through a distorted lens of anxiety"}, {"text": "everything I know I learned from ghosts"}, {"text": "my  dog  has  a  penis  injury "}, {"text": "you ever pass by a cemetery and get jealous?"}, {"text": "coming out of my cage and going immediately back in my cage"}, {"text": "you: hi\nme: [entire story of adolescence + hint about sex + advance warning of all my flaws so you know i know about them before you do]"}, {"text": "let's check and see if we're still bad for each other"}, {"text": "i'm doing absolutely nothing tonight with absolutely no friends if you wanna come"}, {"text": "[shit i can’t say on the internet]"}, {"text": "i don't think we get the dick we think we deserve"}, {"text": "fake news: it's going to be okay"}, {"text": "9 new books recommended by critics and editors at The New York Timeshttps://nyti.ms/2MdrRJM "}, {"text": "looked on the bright side and was like \"ew\""}, {"text": "i came, i saw, i dissociated"}, {"text": "here, let me show you what i mean *starts crying*"}, {"text": "squad goals: total isolation"}, {"text": "it’s on iTunes and all the other shithttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000414376946 …"}, {"text": "if you’re confused, i have a podcast now called “eating alone in my car” where i eat alone in my car"}, {"text": "new episode: soft pretzel\n\ntopics: best ways to die in a natural disaster, worst ways to die in a natural disaster, masturbationhttps://anchor.fm/eating-alone-in-my-car …"}, {"text": "*beats self up for stuff i didn't even do*"}, {"text": "if you don't like me i fucking love you"}, {"text": "trying to have sex with the past"}, {"text": "it's never too late to have a meltdown"}, {"text": "if you need me i'll be trapped inside my head"}, {"text": "am i acting out? yes. does it ever end well? no. does it lead me into a spiral of obsession? definitely. is it beautiful? so beautiful."}, {"text": "live, laugh, love, turn a person into an addiction, flirt but pretend you aren't flirting, lose interest in things you once found enjoyable"}, {"text": ".@petracollins and @selenagomez have debuted their latest joint work, a creepy short horror film written by Melissa Broder (@sosadtoday):\nhttp://www.dazeddigital.com/film-tv/article/40444/1/petra-collins-creepy-short-horror-film-selena-gomez-melissa-broder-instagram …pic.twitter.com/1Rq3oIa4cr"}, {"text": "Editors’ Choice: 9 New Books We Recommend This Weekhttps://nyti.ms/2McnHlc "}, {"text": ".@petracollins debuts a creepy short horror film starring @selenagomez:\nhttp://www.dazeddigital.com/film-tv/article/40444/1/petra-collins-creepy-short-horror-film-selena-gomez-melissa-broder-instagram …pic.twitter.com/FZiZSbrtQn"}, {"text": "currently listening to: very bad ideas"}, {"text": "*whispers during sex* why are people so annoying?"}, {"text": "oops totally didn't mean to be too fragile for this world"}, {"text": "\nwhat’s the point? \n"}, {"text": "torturing myself over things that don't matter is going ok"}, {"text": "another one, wtf is this handwriting, are those Ls or i’s, pls advise, thxpic.twitter.com/KqWcFVi6oz"}, {"text": "two of you were at the signing tonight and i can’t find your damn twitters to follow you, please decode thxpic.twitter.com/dksadnUmAa"}, {"text": "All I want to do is not follow the rules and make out with nice guys and not constantly fear death like wtf man I work hard"}, {"text": "brb, becoming what i hate"}, {"text": "she died as she lived: feeling like she was about to die"}, {"text": "in the car with my sister who almost crashed taking this pic lolpic.twitter.com/7kLkOBMVLu"}, {"text": "see you in half an hour portlandhttps://twitter.com/powells/status/1009408274922426369 …"}, {"text": "thanks but i’d rather pretend I don’t have needs : a love story @sosadtodaypic.twitter.com/huKhRZNomj"}, {"text": "also i’m on instagram now (and it’s destroying my life) if u want to follow me http://instagram.com/realmelissabroder …"}, {"text": "time to turn this into a compulsion: a love story @sosadtodaypic.twitter.com/YVbgFVWu1H"}, {"text": "confuse me like you mean it: a love story @sosadtodaypic.twitter.com/KXz1K4MrYA"}, {"text": "stills from A Love Story, a horror short directed by @petracollins with text written by me starring @selenagomez \n\nyou can watch excerpts on petra’s IGTV channel pic.twitter.com/jO0vMsZqzH"}, {"text": "i am anxiety"}, {"text": "scared of dying and scared of being alive at the same damn time"}, {"text": "you had me at forgetting about me"}, {"text": "A french kiss is when you use tongue. A goth kiss is when you walk down a spiral staircase & are never seen again."}, {"text": "how is life still happening"}, {"text": "Even not in love I’m like let me text someone a million times & ruin my life"}, {"text": "in a threesome with fear of death and fear of life"}, {"text": "hey portland \n\n\n\ni’ll be @Powells tomorrow (june 20) at 7:30 pm 1005 west burnside\n\nwill be signing the pisces, so sad today & last sext\n\nmy sister will be there & i might make her read bad sex scenes from the pisces — if not i will\n\n"}, {"text": "*doesn't get attention for 5 seconds*\n\neverything is over"}, {"text": "i've been tired a lot lately so obviously i'm dying"}, {"text": "listen, you're not doing either of us any favors by not being obsessed with me"}, {"text": "i miss ex-boyfriends who were never my boyfriend"}, {"text": "not destroying myself is a lot of work"}, {"text": "positive thinking won't change the fact that we're going to die"}, {"text": "spoiler: still not enough"}, {"text": "everyone on instagram is pretending life is better than it is"}, {"text": "new episode: swedish fish are goth\n\ntopics: dopamine, internal gothness, skittles, the meaning of lifehttps://itunes.apple.com/us/podcast/eating-alone-in-my-car/id1391561169?mt=2&i=1000413960767 …"}, {"text": "where does it hurt?\n\n*points to existence*"}, {"text": "ever just feel like you don't have a right to exist for your entire life"}, {"text": "body type:\n\ndefinitely getting worse"}, {"text": "oh god the fucking future"}]
